#include "APP.h"

//========================================================================
//                               本地常量声明
//========================================================================

//========================================================================
//                               本地变量声明
//========================================================================

//========================================================================
// 函数: APP_config
// 描述: 用户应用程序初始化.
// 参数: None.
// 返回: None.
// 版本: V1.0, 2020-09-24
//========================================================================
void APP_config(void)
{
    
    // Lamp_init();
    // ADtoUART_init();
    // INTtoUART_init();
    //	RTC_init();
    //	I2C_PS_init();
    //	SPI_PS_init();
    //	EEPROM_init();
    //	WDT_init();
    //	PWMA_Output_init();
    //	PWMB_Output_init();
    //	PCA_PWM_init();
    //	PCA_Capture_init();
    //	PWM15bit_init();
}

void SYS_Init(void)
{
    // LED_Init();
    // OLED_Init();
    // ATGM_StructInit();
    // USART1_Init(115200);
    // USART2_Init(9600);
    // MPU6050_Init();
    // Key_init();



    APP_config();
}
